operations/input-getInventory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v4="http://v4.core.coexprivate.api.shopatron.com">
   <soapenv:Header/>
   <soapenv:Body>
      <v4:getInventory>
         <v4:request>
            <v4:FulfillerID>?</v4:FulfillerID>
            <v4:Catalog>
               <v4:ManufacturerID>?</v4:ManufacturerID>
               <v4:CatalogID>?</v4:CatalogID>
            </v4:Catalog>
            <v4:Quantities>
               <!--1 or more repetitions:-->
               <v4:items>
                  <v4:PartNumber>?</v4:PartNumber>
                  <v4:UPC>?</v4:UPC>
                  <v4:Quantity>?</v4:Quantity>
               </v4:items>
            </v4:Quantities>
            <v4:LocationNames>
               <!--Zero or more repetitions:-->
               <v4:LocationNames>?</v4:LocationNames>
            </v4:LocationNames>
            <v4:Location>
               <v4:Unit>MILES</v4:Unit>
               <v4:Radius>?</v4:Radius>
               <v4:PostalCode>?</v4:PostalCode>
               <v4:Latitude>?</v4:Latitude>
               <v4:Longitude>?</v4:Longitude>
               <v4:CountryCode>?</v4:CountryCode>
            </v4:Location>
            <v4:Type>?</v4:Type>
            <v4:Limit>10000</v4:Limit>
            <v4:IgnoreSafetyStock>false</v4:IgnoreSafetyStock>
            <v4:IncludeNegativeInventory>false</v4:IncludeNegativeInventory>
            <v4:OrderByLTD>?</v4:OrderByLTD>
         </v4:request>
      </v4:getInventory>
   </soapenv:Body>
</soapenv:Envelope>
